app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    product.update(stock: product.stock - 1)
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock", 5], ["updated_at", "2015-04-19 20:37:52.030779"], ["id", 2]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-04-19 20:20:55.668930"], ["updated_at", "2015-04-19 20:20:55.668930"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 1], ["created_at", "2015-04-19 20:20:55.720280"], ["updated_at", "2015-04-19 20:20:55.720280"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-04-19 20:21:04.039863"], ["id", 1]]