app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "image_url", "price", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "dedew"], ["description", "dsfew"], ["image_url", "wefqwe"], ["price", 32.22], ["stock", 1], ["created_at", "2015-04-19 20:09:53.655688"], ["updated_at", "2015-04-19 20:09:53.655688"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "fewfew"], ["price", 1245.87], ["updated_at", "2015-04-19 20:26:12.814109"], ["id", 2]]