app/controllers/store_controller.rb

SELECT "products".* FROM "products" WHERE (stock > 0)  ORDER BY "products"."title" ASC
---
  def index
    @products = Product.order(:title).where('stock > 0')